Revit 2027 API
FailureMessage.GetFailingElements Method
 Retrieves list of the elements that have caused the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetFailingElements()
Public Function GetFailingElements As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetFailingElements()
member GetFailingElements : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The elements that have caused the failure.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace